#### 🖌 Terraform Format and Style ✅

#### ⚙️ Terraform Initialization ✅

#### 🤖 Terraform Validation ✅

<details><summary>Validation Output</summary>

```
```

</details>

#### 🦙 Terraform Lint ✅

<details><summary>Lint Output</summary>

```
```

</details>

#### 📖 Terraform Plan ✅

<details><summary>Show Plan</summary>

```diff
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
scaleway relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/demo-infrastructure/demo-infrastructure/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/demo-infrastructure/demo-infrastructure

To view this run in a browser, visit:
https://app.terraform.io/app/parca-dev/demo-infrastructure-scaleway/runs/run-SZv7f9v19Wyvr3NU

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
scaleway_k8s_cluster.parca_demo: Refreshing state... [id=nl-ams/c2a026b7-5252-4729-b805-aeb910d8d789]
scaleway_k8s_pool.parca_demo_pool_gp1_xs: Refreshing state... [id=nl-ams/169a7656-b338-4987-8450-c976e5aae9a3]
scaleway_k8s_cluster.parca_demo: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # scaleway_k8s_cluster.parca_demo will be updated in-place
  ~ resource "scaleway_k8s_cluster" "parca_demo" {
      + delete_additional_resources = false
        id                          = "nl-ams/c2a026b7-5252-4729-b805-aeb910d8d789"
        name                        = "parca-demo"
      + private_network_id          = (known after apply)
        tags                        = []
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # scaleway_vpc.parca_demo will be created
  + resource "scaleway_vpc" "parca_demo" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + is_default      = (known after apply)
      + name            = "parca-demo"
      + organization_id = (known after apply)
      + project_id      = (known after apply)
      + region          = (known after apply)
      + updated_at      = (known after apply)
    }

  # scaleway_vpc_private_network.parca_demo will be created
  + resource "scaleway_vpc_private_network" "parca_demo" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + is_regional     = (known after apply)
      + name            = "parca-demo"
      + organization_id = (known after apply)
      + project_id      = (known after apply)
      + region          = (known after apply)
      + updated_at      = (known after apply)
      + vpc_id          = (known after apply)
      + zone            = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>

*Pusher: @maxbrunet, Action: `pull_request`, Working Directory: `scaleway`, Workflow: `Terraform`*